benchmark/uniboost_tail/results/Mon Apr 27 01:58:46 UTC 2026/summary_uniboost_qps5.txt
Skipping import of cpp extensions due to incompatible torch version. Please upgrade to torch >= 2.11.0 (found 2.9.1+cu128).
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/home/azrsadmin/sglang/benchmark/uniboost_tail/mix.jsonl', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=5.0, use_trace_timestamps=False, max_concurrency=None, output_file='/home/azrsadmin/sglang/benchmark/uniboost_tail/results/Mon Apr 27 01:58:46 UTC 2026/bench_uniboost_qps5.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=20, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/home/azrsadmin/sglang/benchmark/uniboost_tail/mix.jsonl', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=5.0, use_trace_timestamps=False, max_concurrency=None, output_file='/home/azrsadmin/sglang/benchmark/uniboost_tail/results/Mon Apr 27 01:58:46 UTC 2026/bench_uniboost_qps5.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=20, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 182784
#Output tokens: 320160
Starting warmup with 20 sequences...
Warmup completed with 20 sequences. Starting main benchmark run...
100%|██████████| 1000/1000 [03:29<00:00,  4.78it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    5.0       
Max request concurrency:                 not set   
Successful requests:                     1000      
Benchmark duration (s):                  209.40    
Total input tokens:                      182784    
Total input text tokens:                 182784    
Total generated tokens:                  320160    
Total generated tokens (retokenized):    319988    
Request throughput (req/s):              4.78      
Input token throughput (tok/s):          872.90    
Output token throughput (tok/s):         1528.96   
Peak output token throughput (tok/s):    2166.00   
Peak concurrent requests:                41        
Total token throughput (tok/s):          2401.86   
Concurrency:                             23.40     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   4899.43   
Median E2E Latency (ms):                 3753.12   
P90 E2E Latency (ms):                    11148.40  
P99 E2E Latency (ms):                    20609.28  
---------------Time to First Token----------------
Mean TTFT (ms):                          66.54     
Median TTFT (ms):                        40.56     
P99 TTFT (ms):                           474.59    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.86     
Median TPOT (ms):                        15.15     
P99 TPOT (ms):                           21.79     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           15.14     
Median ITL (ms):                         13.52     
P95 ITL (ms):                            22.24     
P99 ITL (ms):                            35.09     
Max ITL (ms):                            703.75    
==================================================